docs/elementaryOS/elementaryOS_running_emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-12 Mon 22:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>elementary OS Setting up Hangul Input guide.</title>
<meta name="author" content="Taylor Shin" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">elementary OS Setting up Hangul Input guide.</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc7713c7">1. Heads up Note</a></li>
<li><a href="#org8f56d63">2. At first, installing &rsquo;new&rsquo; emacs needs a repo.</a></li>
<li><a href="#org77e905b">3. Then install 27.1 by&#x2026;</a></li>
<li><a href="#org937985e">4. Mods: Doomemacs can be installed with ../../bin/install<sub>doomemacs.sh</sub>. But it needs newest git. We also need to add PPA for newest git.</a>
<ul>
<li><a href="#org48d3c96">4.1. Yeah, we are installing git again.</a></li>
</ul>
</li>
<li><a href="#org7194396">5. Then, the GTK+3 on elementary OS has a big big trouble. We need to set up some environment variable for emacs.</a>
<ul>
<li><a href="#org5e69031">5.1. Add the line below to ~/.bashrc</a></li>
<li><a href="#orgbd3ebb9">5.2. Now we can use emacs normally&#x2026;</a></li>
</ul>
</li>
<li><a href="#org19db56b">6. Doomemacs stuff.</a>
<ul>
<li><a href="#org7089bc3">6.1. HOLD We need modern cmake and libtool to build vterm.</a>
<ul>
<li><a href="#org4f33dbe">6.1.1. Apparently, those old infrastructure prevents building vterm. You can still use eterm. SPC-o-e</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgc7713c7" class="outline-2">
<h2 id="orgc7713c7"><span class="section-number-2">1</span> Heads up Note</h2>
<div class="outline-text-2" id="text-1">
<p>
This walkthrough is not designed for the &rsquo;long&rsquo; way. Installing GccEmacs and setting the environment up is not in the scope of this script! If you want to take this &rsquo;grandeur&rsquo; way, better work with the homebrew compilation scripts!
</p>
</div>
</div>

<div id="outline-container-org8f56d63" class="outline-2">
<h2 id="org8f56d63"><span class="section-number-2">2</span> At first, installing &rsquo;new&rsquo; emacs needs a repo.</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b58900; font-style: italic;">sudo</span> add-apt-repository ppa:kellyk/emacs
<span style="color: #b58900; font-style: italic;">sudo</span> apt-get update
</pre>
</div>
</div>
</div>

<div id="outline-container-org77e905b" class="outline-2">
<h2 id="org77e905b"><span class="section-number-2">3</span> Then install 27.1 by&#x2026;</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-sh"> <span style="color: #b58900; font-style: italic;">sudo</span> apt-get install emacs27
</pre>
</div>
</div>
</div>

<div id="outline-container-org937985e" class="outline-2">
<h2 id="org937985e"><span class="section-number-2">4</span> Mods: Doomemacs can be installed with ../../bin/install<sub>doomemacs.sh</sub>. But it needs newest git. We also need to add PPA for newest git.</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-sh"> <span style="color: #b58900; font-style: italic;">sudo</span> add-apt-repository ppa:git-core/ppa
 <span style="color: #b58900; font-style: italic;">sudo</span> apt-get update
 <span style="color: #b58900; font-style: italic;">sudo</span> apt-get install -y <span style="color: #b58900; font-style: italic;">git</span>
</pre>
</div>
</div>

<div id="outline-container-org48d3c96" class="outline-3">
<h3 id="org48d3c96"><span class="section-number-3">4.1</span> Yeah, we are installing git again.</h3>
</div>
</div>

<div id="outline-container-org7194396" class="outline-2">
<h2 id="org7194396"><span class="section-number-2">5</span> Then, the GTK+3 on elementary OS has a big big trouble. We need to set up some environment variable for emacs.</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org5e69031" class="outline-3">
<h3 id="org5e69031"><span class="section-number-3">5.1</span> Add the line below to ~/.bashrc</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d33682; font-style: italic;">alias</span> <span style="color: #268bd2;">emacs</span>=<span style="color: #2aa198;">'XLIB_SKIP_ARGB_VISUALS=1 emacs'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd3ebb9" class="outline-3">
<h3 id="orgbd3ebb9"><span class="section-number-3">5.2</span> Now we can use emacs normally&#x2026;</h3>
</div>
</div>

<div id="outline-container-org19db56b" class="outline-2">
<h2 id="org19db56b"><span class="section-number-2">6</span> Doomemacs stuff.</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org7089bc3" class="outline-3">
<h3 id="org7089bc3"><span class="section-number-3">6.1</span> HOLD We need modern cmake and libtool to build vterm.</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org4f33dbe" class="outline-4">
<h4 id="org4f33dbe"><span class="section-number-4">6.1.1</span> Apparently, those old infrastructure prevents building vterm. You can still use eterm. SPC-o-e</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Taylor Shin</p>
<p class="date">Created: 2021-04-12 Mon 22:26</p>
</div>
</body>
</html>
